---
kind: type
id: T:Autodesk.Revit.DB.Visual.StoneApplicationType
source: html/7bda1285-1efa-3a73-44ab-f82880a3d7e8.htm
---
# Autodesk.Revit.DB.Visual.StoneApplicationType

The enumerated type representing the permitted values for the asset property "StoneApplication" from the "Stone" schema.

## Syntax (C#)
```csharp
public enum StoneApplicationType
```